# Advanced Data Preparation with Python (Car Data)

## Libraries and settings

In [19]:
# Libraries
import os
import re
import time
import fnmatch
import numpy as np
import pandas as pd
import seaborn as sns
from datetime import datetime
import matplotlib.pyplot as plt
import pytz as tz ### imports timezone library 

# Ignore warnings
import warnings
warnings.filterwarnings("ignore")

# Get current working directory
print(os.getcwd())

/workspaces/python_data_preparation

## Importing data

In [20]:
# Import data from csv to pandas dataframe named 'df'
df = pd.read_csv('./Data/autoscout24_data.csv', sep=";", encoding='utf-8')

# Change the column names to lowercase
df.columns = df.columns.str.lower()

# Display the first 5 rows of the dataframe
df.head()

,url_short,offer_id,scrape_dt,type,price_raw,hp_raw,init_regist,mileage_raw,fuel_type,transmission,dealer_name,dealer_plz,dealer_city,dealer_street_house_nr,dealer_telnr,init_regist_my,init_regist_month,init_regist_year,init_regist_dt
0,https://www.autoscout24.ch/7324420,7324420,2020_03_17 07:34:45,AUDI A5 Sportback 3.0 TDI quattro S-tronic (Li...,CHF 22'500.–,245 PS,10.2014,75'000 km,Diesel,Automatisiertes Schaltgetriebe,***confidential***,8488,Turbenthal,Mettlenstrasse 3,***confidential***,10.2014,10.0,2014.0,2014-10
1,https://www.autoscout24.ch/7512768,7512768,2020_03_17 07:34:55,MERCEDES-BENZ SLK 200 7G-Tronic (Cabriolet),CHF 23'749.–,184 PS,6.2013,46'655 km,Benzin,Automat sequentiell,***confidential***,3186,Düdingen,Brugerastrasse 60,***confidential***,6.2013,6.0,2013.0,2013-06
2,https://www.autoscout24.ch/7512034,7512034,2020_03_17 07:35:03,MERCEDES-BENZ C 350 Avantgarde 4Matic 7G-Troni...,CHF 18'500.–,306 PS,6.2011,138'955 km,Benzin,Automat sequentiell,***confidential***,1262,Eysins,1262 Eysins,***confidential***,6.2011,6.0,2011.0,2011-06
3,https://www.autoscout24.ch/7512728,7512728,2020_03_17 07:35:06,MERCEDES-BENZ A 45 AMG 4Matic Speedshift 7G-DC...,CHF 36'000.–,360 PS,8.2015,43'000 km,Benzin,Automatisiertes Schaltgetriebe,***confidential***,4314,Zeiningen,Am Stutz 21,***confidential***,8.2015,8.0,2015.0,2015-08
4,https://www.autoscout24.ch/7490242,7490242,2020_03_17 07:35:16,AUDI A5 Sportback 2.0 TFSI Sport quattro S-tro...,CHF 48'500.–,252 PS,9.2018,43'300 km,Benzin,Automatisiertes Schaltgetriebe,***confidential***,3250,Lyss,3250 Lyss,***confidential***,9.2018,9.0,2018.0,2018-09

## Count number of rows and columns in the data frame

In [21]:
# Count number of rows and columns in the data frame
df.shape

(3980, 19)

## Get data types (raw-format from web scraper)

In [22]:
# Get data types of each column
df.dtypes

### 'object' types sind kombinierte oder unklare datatypes

url_short                  object
offer_id                    int64
scrape_dt                  object
type                       object
price_raw                  object
hp_raw                     object
init_regist                object
mileage_raw                object
fuel_type                  object
transmission               object
dealer_name                object
dealer_plz                  int64
dealer_city                object
dealer_street_house_nr     object
dealer_telnr               object
init_regist_my             object
init_regist_month         float64
init_regist_year          float64
init_regist_dt             object
dtype: object

## Extract information from raw data using regular expressions (regex)

### Extract numerical values from mileage_raw

In [23]:
# Extract numerical values from mileage_raw
mileage = []
for i in df['mileage_raw']:
    i = i.replace("'","")
    d1 = re.findall('(\d+)\s*km', i)
    try:
        d2 = d1[0].strip().replace("'",'')
    except:
        d2 = None
    mileage.append(d2)


# Save as new variable in the pandas data frame
df['mileage'] = pd.Series(mileage, dtype="Int64")

# Show first records of data frame
df[['mileage_raw', 'mileage']].head()

  mileage_raw  mileage
0   75'000 km    75000
1   46'655 km    46655
2  138'955 km   138955
3   43'000 km    43000
4   43'300 km    43300

### Extract numerical values from hp_raw

In [24]:
# Extract numerical values from hp_raw
horsepower = []
for i in df['hp_raw']:
    d1 = re.findall('(\d+)', i)
    try:
        d2 = d1[0].strip()
    except:
        d2 = None
    horsepower.append(d2)


# Save as new variable in the pandas data frame
df['horsepower'] = pd.Series(horsepower, dtype="Int64")

# Show first records of data frame
df[['hp_raw', 'horsepower']].head()

   hp_raw  horsepower
0  245 PS         245
1  184 PS         184
2  306 PS         306
3  360 PS         360
4  252 PS         252

### Extract numerical values from price_raw

In [25]:
# Extract numerical values from mileage_raw
price = []
for i in df['price_raw']:
    ### replaces the apostrophe (as 1000-separator) with nothing, effectively making regex find all digits as one number
    i = i.replace("'","")
    d1 = re.findall('(\d+)', i)
    try:
        d2 = d1[0].strip()
    except:
        d2 = None
    price.append(d2)

# Save as new variable in the pandas data frame
df['price'] = pd.Series(price, dtype="Int64")

# Show first records of data frame
df[['price_raw', 'price']].head()

      price_raw  price
0  CHF 22'500.–  22500
1  CHF 23'749.–  23749
2  CHF 18'500.–  18500
3  CHF 36'000.–  36000
4  CHF 48'500.–  48500

### Get data types of all variables, including the new once

In [26]:
# Get data types of all variables
df.dtypes

url_short                  object
offer_id                    int64
scrape_dt                  object
type                       object
price_raw                  object
hp_raw                     object
init_regist                object
mileage_raw                object
fuel_type                  object
transmission               object
dealer_name                object
dealer_plz                  int64
dealer_city                object
dealer_street_house_nr     object
dealer_telnr               object
init_regist_my             object
init_regist_month         float64
init_regist_year          float64
init_regist_dt             object
mileage                     Int64
horsepower                  Int64
price                       Int64
dtype: object

## Count and remove missing values

In [27]:
# Count and remove missing values
### this is the number of missing values per column
print(f"Number of missing values: {pd.isna(df).sum()}")
### this summearises the number above
print(f"Number of missing values: {pd.isna(df).sum().sum()}")

df = df.dropna().reset_index(drop=True)

# Reset the index of the dataframe
### this does essentially both steps (dropping NA + resetting Index) in one go
df = df.dropna().reset_index(drop=True)

Number of missing values: url_short                 0
offer_id                  0
scrape_dt                 0
type                      0
price_raw                 0
hp_raw                    0
init_regist               0
mileage_raw               0
fuel_type                 0
transmission              0
dealer_name               0
dealer_plz                0
dealer_city               0
dealer_street_house_nr    2
dealer_telnr              0
init_regist_my            0
init_regist_month         7
init_regist_year          7
init_regist_dt            7
mileage                   0
horsepower                0
price                     0
dtype: int64
Number of missing values: 23

## Count and remove duplicated values

In [28]:
# Count and remove duplicates
### count of cuplicate values on the column 'offer_id'. But it doesnt find anything, is this true? Maybe I check in excel --> >TODO
print(f"Number of duplicated values: {df[df[['offer_id']].duplicated()].sum().sum()}")
print(f"Number of duplicated values: {df.duplicated().sum().sum()}")                                        

# Reset the index of the dataframe
### this does essentially both steps (dropping duplicates + resetting Index) in one go
df = df.drop_duplicates().reset_index(drop=True)

Number of duplicated values: 0.0
Number of duplicated values: 0

## Use string manipulation methods to create additional variables from the car type

### Change strings in 'type' to uppercase

In [29]:
# Change strings in 'type' to uppercase and remove leading and trailing whitespaces
df['type'] = df['type'].str.upper()
df['type'] = df['type'].str.strip()

# Display variable 'type'
df['type'].tail()

3966              FERRARI F360 SPIDER (CABRIOLET)
3967      MERCEDES-BENZ SL 500 560 SL (CABRIOLET)
3968    MERCEDES-BENZ CL 63 AMG 7G-TRONIC (COUPÉ)
3969                  BMW 328I CABRIO (CABRIOLET)
3970            BMW 328I CABRIO SPORT (CABRIOLET)
Name: type, dtype: object

### Calculate length of strings in 'type'

In [30]:
# Calculate length of strings in 'type'
df['type_len'] = df['type'].str.len()


# Display variables 'type' and 'type_len'
df[['type', 'type_len']]

                                                   type  type_len
0     AUDI A5 SPORTBACK 3.0 TDI QUATTRO S-TRONIC (LI...        54
1           MERCEDES-BENZ SLK 200 7G-TRONIC (CABRIOLET)        43
2     MERCEDES-BENZ C 350 AVANTGARDE 4MATIC 7G-TRONI...        59
3     MERCEDES-BENZ A 45 AMG 4MATIC SPEEDSHIFT 7G-DC...        59
4     AUDI A5 SPORTBACK 2.0 TFSI SPORT QUATTRO S-TRO...        61
...                                                 ...       ...
3966                    FERRARI F360 SPIDER (CABRIOLET)        31
3967            MERCEDES-BENZ SL 500 560 SL (CABRIOLET)        39
3968          MERCEDES-BENZ CL 63 AMG 7G-TRONIC (COUPÉ)        41
3969                        BMW 328I CABRIO (CABRIOLET)        27
3970                  BMW 328I CABRIO SPORT (CABRIOLET)        33

[3971 rows x 2 columns]

### Create binary (0/1) variable 'luxury_car'

In [31]:
### not clear if there is supposed to be a text filter involved. 
### as for now, I will simply create the column

### doesnt work:   df['luxury_car'].astype(int)

### Create variable 'price_per_hp'

In [32]:
### includes rounding to the 2nd decimal place
df['price_per_hp'] = round(df['price'] / df['horsepower'],2)

### print the result
### dont forget the double-squared-brackets
df[['type', 'price_per_hp', 'price', 'horsepower']]

,type,price_per_hp,price,horsepower
0,AUDI A5 SPORTBACK 3.0 TDI QUATTRO S-TRONIC (LI...,91.84,22500,245
1,MERCEDES-BENZ SLK 200 7G-TRONIC (CABRIOLET),129.07,23749,184
2,MERCEDES-BENZ C 350 AVANTGARDE 4MATIC 7G-TRONI...,60.46,18500,306
3,MERCEDES-BENZ A 45 AMG 4MATIC SPEEDSHIFT 7G-DC...,100.0,36000,360
4,AUDI A5 SPORTBACK 2.0 TFSI SPORT QUATTRO S-TRO...,192.46,48500,252
...,...,...,...,...
3966,FERRARI F360 SPIDER (CABRIOLET),146.0,58400,400
3967,MERCEDES-BENZ SL 500 560 SL (CABRIOLET),68.53,15900,232
3968,MERCEDES-BENZ CL 63 AMG 7G-TRONIC (COUPÉ),80.0,42000,525
3969,BMW 328I CABRIO (CABRIOLET),51.71,9980,193
3970,BMW 328I CABRIO SPORT (CABRIOLET),69.95,13500,193

### Include current datetime as time stamp

In [33]:
### this is outside the course scope, but I imported another timezone library 
### and in this function I am converting the current time to the timezone of Zurich
zurich_tz = tz.timezone('Europe/Zurich')

### strfrtime is a function to convert a datetime object to a string, then follows the format 
### and the '%' signs are padding operators
### watch how '.now' takes an argument now, which is basically just an offset to UTC
df['datetime'] = datetime.now(zurich_tz).strftime("%Y-%m-%d %H:%M:%S")

df[['type', 'scrape_dt', 'datetime']].head()

,type,scrape_dt,datetime
0,AUDI A5 SPORTBACK 3.0 TDI QUATTRO S-TRONIC (LI...,2020_03_17 07:34:45,2024-10-24 21:34:23
1,MERCEDES-BENZ SLK 200 7G-TRONIC (CABRIOLET),2020_03_17 07:34:55,2024-10-24 21:34:23
2,MERCEDES-BENZ C 350 AVANTGARDE 4MATIC 7G-TRONI...,2020_03_17 07:35:03,2024-10-24 21:34:23
3,MERCEDES-BENZ A 45 AMG 4MATIC SPEEDSHIFT 7G-DC...,2020_03_17 07:35:06,2024-10-24 21:34:23
4,AUDI A5 SPORTBACK 2.0 TFSI SPORT QUATTRO S-TRO...,2020_03_17 07:35:16,2024-10-24 21:34:23

## Discretization of numerical data

In [34]:
### what are the borders and sizes of these bins?


df['price_category'] = pd.cut(df['price'], 
                                bins = 5, 
                                labels = ['very cheap', 
                                            'cheap', 
                                            'normal', 
                                            'expensive', 
                                            'very expensive'])

### What else could I do with these bins?
df['price_category'].unique()

['very cheap', 'cheap', 'very expensive', 'normal', 'expensive']
Categories (5, object): ['very cheap' < 'cheap' < 'normal' < 'expensive' < 'very expensive']

## One Hot Encoding

In [36]:
### One Hot Encoding is a process in the data processing where categorical variables are converted into a form 
### that could be provided to ML algorithms to do a better job in prediction.

try:
    df = pd.get_dummies(df, 
                        columns=['price_category'], 
                        drop_first=False)
except:
    print("Dummy variables already exist")

# Convert boolean values to integers (0 and 1)
### the filter operation selects all the columns containing the string 'price_category'
### the 'df.columns' extracts the column names
### the 'astype' function converts the values (were boolean) to integer
df[df.filter(like='price_category').columns] = df.filter(like='price_category').astype(int)

# Show values of the new dummy variables
df.filter(like='price_category').head()

,price_category_very cheap,price_category_cheap,price_category_normal,price_category_expensive,price_category_very expensive
0,1,0,0,0,0
1,1,0,0,0,0
2,1,0,0,0,0
3,1,0,0,0,0
4,1,0,0,0,0

## Scaling

### Min-Max Scaling

### Max-Absolute Scaling

### Robust Scaling

## Standardization

### Z-score Normalization

## Transformation

### Log-Transformation

### SQRT-Transformation

### Box-Cox Transformation

## Combining & organizing data

### Reading car data with geocoded addresses

### Join geo-information to car data using .merge()

### Reading municipality-level data from an .xlsx - file

### Join municipality-level data to the car data data using .merge()

### Sorting data

### Reshaping data

#### Reshaping data using .stack() and .unstack()

#### Reshaping data using .melt()

### Pivoting data using .pivot_table()

### Jupyter notebook --footer info-- (please always provide this at the end of each notebook)

In [ ]:
import os
import platform
import socket
from platform import python_version
from datetime import datetime

print('-----------------------------------')
print(os.name.upper())
print(platform.system(), '|', platform.release())
print('Datetime:', datetime.now().strftime("%Y-%m-%d %H:%M:%S"))
print('Python Version:', python_version())
print('-----------------------------------')